zxyroger/esp32-deskbot/firmware/sdkconfig.defaults
#
# ESP32-S3 Scratch 服务器默认配置 (ESP-IDF v5.5.4)
# 需要修改 WiFi 信息时: idf.py menuconfig -> "ESP32-S3 Scratch 服务器配置"
#

CONFIG_IDF_TARGET="esp32s3"

# 板载 I2C 总线: SDA=GPIO1 / SCL=GPIO2 (总线上挂着 ES8311 音频 codec, 地址 0x30)
CONFIG_TMX_I2C_SDA_PIN=1
CONFIG_TMX_I2C_SCL_PIN=2

# 板载 OV2640 DVP 摄像头 (接线见 docs/camera-ov2640.md)
#   DVP: XCLK=8 PCLK=16 VSYNC=3 HREF=46 PWDN=48
#        D0=7 D1=5 D2=4 D3=6 D4=15 D5=17 D6=18 D7=9
#   SCCB (SIOD/SIOC) 复用上面那条 I2C 总线 (GPIO1/GPIO2), 驱动直接挂上去
CONFIG_TMX_CAMERA_ENABLE=y
CONFIG_TMX_CAMERA_XCLK_PIN=8
CONFIG_TMX_CAMERA_PCLK_PIN=16
CONFIG_TMX_CAMERA_VSYNC_PIN=3
CONFIG_TMX_CAMERA_HREF_PIN=46
CONFIG_TMX_CAMERA_PWDN_PIN=48
CONFIG_TMX_CAMERA_RESET_PIN=-1
CONFIG_TMX_CAMERA_SIOD_PIN=1
CONFIG_TMX_CAMERA_SIOC_PIN=2
CONFIG_TMX_CAMERA_D0_PIN=7
CONFIG_TMX_CAMERA_D1_PIN=5
CONFIG_TMX_CAMERA_D2_PIN=4
CONFIG_TMX_CAMERA_D3_PIN=6
CONFIG_TMX_CAMERA_D4_PIN=15
CONFIG_TMX_CAMERA_D5_PIN=17
CONFIG_TMX_CAMERA_D6_PIN=18
CONFIG_TMX_CAMERA_D7_PIN=9
# XCLK 20MHz, 用 LEDC 定时器 1 + 通道 6 (定时器 2/通道 7 是 LCD 背光的)
# XCLK 24MHz: OV2640 的寄存器表 (esp32-camera 的 ov2640_settings_*) 是按 24MHz 调的。
# 实测 20MHz 时画面全是噪点、JPEG 头里的 DHT/SOF 标记字节还会被采错
# (C4->C5 / C0->C1), 一半的帧连解码都过不去; 10MHz 更差。24MHz 下都正常。
CONFIG_TMX_CAMERA_XCLK_FREQ_HZ=24000000
CONFIG_TMX_CAMERA_XCLK_LEDC_TIMER=1
CONFIG_TMX_CAMERA_XCLK_LEDC_CHANNEL=6
# VGA + 1 份帧缓冲 (本板没开 PSRAM, 帧缓冲/DMA 缓冲都在内部 RAM:
# VGA 约 61KB 帧缓冲 + 32KB DMA; 内存够就改 FB_COUNT=2 换更流畅)
CONFIG_TMX_CAMERA_FRAMESIZE_VGA=y
CONFIG_TMX_CAMERA_JPEG_QUALITY=12
CONFIG_TMX_CAMERA_FB_COUNT=1
CONFIG_TMX_CAMERA_STREAM_INTERVAL_MS=200
# JPEG 帧缓冲改成本地指定的大小: 自动算法是 w*h/5 = 61KB, 碰到细节多的画面
# (VGA + 质量 20 实测能到 ~80KB) 会被驱动判成 FB-OVF 整帧丢掉;
# 这里给 100KB, 内部 RAM 够放 (本板没开 PSRAM)
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM=y
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE=100000
# 排障用: 上电量一遍 DVP 各信号线的活动 (平时保持 n)
CONFIG_TMX_CAMERA_PIN_PROBE=n

# SCCB 走新版 i2c_master 驱动 (只有新版才支持"挂到已有 I2C 总线")
CONFIG_SCCB_HARDWARE_I2C_DRIVER_NEW=y
# 只留 OV2640 的传感器驱动, 其余关掉省 flash 和编译时间
CONFIG_OV2640_SUPPORT=y
CONFIG_OV7670_SUPPORT=n
CONFIG_OV7725_SUPPORT=n
CONFIG_NT99141_SUPPORT=n
CONFIG_OV3660_SUPPORT=n
CONFIG_OV5640_SUPPORT=n
CONFIG_GC2145_SUPPORT=n
CONFIG_GC032A_SUPPORT=n
CONFIG_GC0308_SUPPORT=n
CONFIG_BF3005_SUPPORT=n
CONFIG_BF20A6_SUPPORT=n
CONFIG_SC101IOT_SUPPORT=n
CONFIG_SC030IOT_SUPPORT=n
CONFIG_SC031GS_SUPPORT=n
CONFIG_HM1055_SUPPORT=n
CONFIG_HM0360_SUPPORT=n
CONFIG_MEGA_CCM_SUPPORT=n

# 用板子上的原生 USB 口 (USB Serial/JTAG) 作为调试串口：
# 一根 USB 线同时用于烧录、看日志、复位，不需要 USB 转串口芯片。
# 注意：此时 GPIO19/20 被 USB PHY 占用，固件会拒绝把它们当普通 IO 使用。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 如果想改回 UART0 (GPIO43/44) 输出日志，把上面一行换成下面这行：
# CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# 主任务只做启动，真正的服务器跑在独立任务里
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# 让 FreeRTOS tick 为 1ms，与 Arduino 版本的 delay(1) 行为一致
CONFIG_FREERTOS_HZ=1000

# 服务器任务里会用到日志格式化、i2c、socket，栈给足
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072

# 固件不大，默认分区表即可；如需 OTA/文件系统请在 menuconfig 中改
# 16MB Flash + 自定义分区表 (app 4MB + TTS 音色数据 voice_data 3MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16m.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_16m.csv"
